arturoriegaore/ESP32S3_TDV_ESTAMPADO_SALVADE_PRUEBA_SERVER_BD_WEB/src/main.cpp
updateLedStatusRTC(); //alarma si no se logra actualizar datos de servidor ntp
Serial.println("\n\nNo se pudo actualizar Tiempo de ESP32 y DS3231"); 

  }
}



/*--------WIFI----------*/
const char *wifi_ssid = "WF_TDV_PLC";                    //WF_TDV_PLC 
const char *wifi_password = "M4qPLC$*-+/";                //M4qPLC$*-+/
IPAddress local_IP(172, 16, 2, 210);                 //IPAddress local_IP(172, 16, 2, 201);
IPAddress gateway(172, 16, 2, 1);                   //IPAddress gateway(172, 16, 2, 1);
IPAddress subnet(255, 255, 254, 0);                    //IPAddress subnet(255, 255, 254, 0);
IPAddress primary_dns(131, 107, 32, 217);              //131, 107, 32, 217
IPAddress secondary_dns(131, 107, 32, 218);            //131, 107, 32, 218

unsigned long ultimoIntento = 0;   
int countReconectWifi = 0;
const int intervaloReconexion = 1000;

void reconnectWiFi() {
  if (WiFi.status() != WL_CONNECTED) {   

    unsigned long tiempoActual = millis();
    if (tiempoActual - ultimoIntento >= intervaloReconexion) {
      ultimoIntento = tiempoActual;
      
      if (countReconectWifi == 0) {
        DEBUG_PRINT("\n\n\nReconectando a la red Wi-Fi  ");
        WiFi.disconnect();


         // Usar IP estática y DNS                                        
        if (!WiFi.config(local_IP, gateway, subnet, primary_dns, secondary_dns))   {  
        DEBUG_PRINT("\n\nError al configurar la IP estática y DNS");    
        }

        WiFi.begin(wifi_ssid, wifi_password);
      }
      
      DEBUG_PRINT(".");
      countReconectWifi++;

      if (countReconectWifi > 10) {
        
        DEBUG_PRINT("\n\nConexion WIFI Fallida Reintentando ");
        countReconectWifi = 0;
      }
    }
  } else {

    if (countReconectWifi > 0) {
    
      DEBUG_PRINT("\n\n           Conexion WIFI Exitosa   ->    IP Tarjeta :  ");
      DEBUG_PRINT(WiFi.localIP());
      Serial.print("\n           Conectado a : ");
      Serial.println(WiFi.SSID());  // Muestra el SSID de la red

      Serial.print("           BSSID: ");
      Serial.println(WiFi.BSSIDstr());  // Muestra la dirección BSSID del punto de acceso
     
    }
    countReconectWifi = 0;

    runSetupServerNTP();

  }

}






/*--------VARIABLES GLOVALES----------*/

String url_api = "https://developer.textildelvalle.pe:444/GENExtraccionSenalesBE/api/Evento/Write"; //http://192.168.54.161/BackEnd2/api/Rectilineo/Write


const char* codDevice = "DeviceTejRecR609";
const char* codMaquina = "R609";    
const char* codParoIN1 = "MP001";      //START/STOP               HIGH
const char* codParoIN2 = "MP002";      //HILO SUPERIOR            HIHG  /LOW para J2
const char* codParoIN3 = "MP003";      //HILO LATERAL             HIGH
const char* codParoIN4 = "MP004";      //ANTIRREMOTADA
const char* codParoIN5 = "MP005";      //PUERTA                   LOW
const char* codParoIN6 = "MP006";      //CAIDA DE TELA            LOW
const char* codParoIN7 = "MP007";      //LYCRA
const char* codParoIN8 = "MP008";      //PUERTA LATERAL           LOW
const char* codParoIN9 = "RPM";        //RPM 
const char* codParoIN10 = "CONTADOR";  //CONTADOR DE UNIDADES

/*--------CONTADOR DE UNIDADES----------*/
volatile unsigned long count = 0;    

/*--------DEFINE EL INTERVALO DE TIEMPO DE ENVIO SI HAY DATOS GUARDADOS----------*/
int timeupdateSendHTTP = 1;
const unsigned long interval1 = timeupdateSendHTTP * 60 * 1000; 
unsigned long previousTime1 = 0;

/*--------DEFINE EL INTERVALO DE TIEMPO PARA VERIFICAR SI HAY ACTUALIZACIONES DE CODIGO DESDE SISTEMAS----------*/
int timeupdatewifi = 100; //tiempo en minutos para actualizar credenciales wifi
const unsigned long interval2 = timeupdatewifi * 60 * 1000; //Envio de datos para actualizar Wifi
unsigned long previousTime2 = 0;





DynamicJsonDocument json(2048);
DynamicJsonDocument apiResponse(256);
HTTPClient http;
QueueHandle_t queue;  //Cola

Bounce debouncer1 = Bounce();
Bounce debouncer2 = Bounce();
Bounce debouncer3 = Bounce();
Bounce debouncer4 = Bounce();
Bounce debouncer5 = Bounce();
Bounce debouncer6 = Bounce();
Bounce debouncer7 = Bounce();
Bounce debouncer8 = Bounce();
Bounce debouncer9 = Bounce();


struct InputInfo
 {
  uint8_t pin;
  int state;
 };


/*--------TAREA EN CORE 0 (LOOP-2)----------*/
void Task1code( void * pvParameters ) {
  for (;;) {
   
  if (debouncer1.update()) {
    int value = debouncer1.read();
    InputInfo info = {IN1, value};
    xQueueSend(queue, &info, 0); //xQueueSend(queue, &info, portMAX_DELAY);
  }
  if (debouncer2.update()) {
    int value = debouncer2.read();
    InputInfo info = {IN2, value};
    xQueueSend(queue, &info, 0); //xQueueSend(queue, &info, portMAX_DELAY);
  }
  if (debouncer3.update()) {
    int value = debouncer3.read();
    InputInfo info = {IN3, value};
    xQueueSend(queue, &info, 0); //xQueueSend(queue, &info, portMAX_DELAY);
  }
  if (debouncer4.update()) {
    int value = debouncer4.read();
    InputInfo info = {IN4, value};
    xQueueSend(queue, &info, 0); //xQueueSend(queue, &info, portMAX_DELAY);
  }
  if (debouncer5.update()) {
    int value = debouncer5.read();
    InputInfo info = {IN5, value};
    xQueueSend(queue, &info, 0); //xQueueSend(queue, &info, portMAX_DELAY);
  }
  if (debouncer6.update()) {
    int value = debouncer6.read();
    InputInfo info = {IN6, value};
    xQueueSend(queue, &info, 0); //xQueueSend(queue, &info, portMAX_DELAY);
  }
  if (debouncer7.update()) {
    int value = debouncer7.read();
    InputInfo info = {IN7, value};
    xQueueSend(queue, &info, 0); //xQueueSend(queue, &info, portMAX_DELAY);
  }
  if (debouncer8.update()) {
    int value = debouncer8.read();
    InputInfo info = {IN8, value};
    xQueueSend(queue, &info, 0); //xQueueSend(queue, &info, portMAX_DELAY);
  }
  if (debouncer9.update()) {
    int value = debouncer9.read();
    InputInfo info = {IN9, value};
    xQueueSend(queue, &info, 0); //xQueueSend(queue, &info, portMAX_DELAY);
  }




    vTaskDelay(1); // Agrega un pequeño retardo para liberar el procesador
  
  }
}


/*--------INDICADORES BALIZA RELE----------*/
void updateReleStatusInput() {

  if (digitalRead(IN1) == HIGH)
   { digitalWrite(RL1, HIGH);
   } else {
    digitalWrite(RL1, LOW);
   }

