arturoriegaore/ESP32S3_TDV_ESTAMPADO_SALVADE_PRUEBA_SERVER_BD_WEB/src/main.cpp
/*
  if (digitalRead(IN3) == LOW || digitalRead(IN4) == LOW || digitalRead(IN5) == LOW || digitalRead(IN6) == LOW || digitalRead(IN7) == LOW || digitalRead(IN9) == LOW)
   { digitalWrite(RL2, HIGH);
   } else {
    digitalWrite(RL2, LOW);
   }
*/

}


/*--------LED SE ENCIENDE SI EL DEVICE ESTA CONECTADO A WIFI----------*/
void updateLedStatusWifi() {
  if (WiFi.status() != WL_CONNECTED) {
    digitalWrite(LEDWIFI, LOW);  // Apagar LED
  } else {
    digitalWrite(LEDWIFI, HIGH); // Encender LED
  }
}





/*--------CONTADOR DE UNIDADES----------*/
void IRAM_ATTR countInterrupt() {
  count++;   // Incrementar el contador cada vez que se detecte un cambio en el pin de entrada
}


/*--------ALMACENAMIENTO FLASH----------*/
void displayLittleFSSpace() {

  //prueba para ver espacio : inicio
  Serial.print("     Almacenamiento flash total (bytes): ");
  Serial.println(ESP.getFlashChipSize());
  Serial.print("     Almacenamiento flash usado (bytes): ");
  Serial.println(ESP.getSketchSize());

  Serial.print("     Espacio total en LittleFS: ");
  Serial.print(LittleFS.totalBytes() / (1024.0 * 1024.0));
  Serial.println(" MB");

  Serial.print("     Espacio usado en LittleFS: ");
  Serial.print(LittleFS.usedBytes() / (1024.0 * 1024.0));
  Serial.println(" MB");

  //prueba : fin

  
  
  // Calcular el porcentaje de espacio utilizado
  float percentageUsed = (float)LittleFS.usedBytes() / (float)LittleFS.totalBytes() * 100;

  // Mostrar el porcentaje de espacio utilizado con dos decimales
  Serial.print("\n     Espacio Usado de Memoria: ");
  Serial.printf("%.2f", percentageUsed);
  Serial.println(" %");

}

void initializeLittleFS() {

if (!LittleFS.begin()) {  //!  FORMATEAR MEMORIA QUINATR SIGNO LUEGO VOLVER A COLOCAR
  Serial.println("\n     Error al Inicializar LittleFS, Formateando...");
  if (LittleFS.format()) {
    Serial.println("\n     Formateo de LittleFS Completado");
  } else {
    Serial.println("\n     Error al Formatear LittleFS");
    return;
  }
  if (!LittleFS.begin()) {
    Serial.println("\n     Error al Inicializar LittleFS Después de Formatear");
    return;
  }
} else {
  Serial.println("\n     LittleFS Inicializado Correctamente"); // Agrega este mensaje de éxito
}
}

void ensureFileExists() {
  if (!LittleFS.exists("/data.txt")) {
    File file = LittleFS.open("/data.txt", "a");  //w
    if (!file) {
      Serial.println("\n     Error al Crear el Archivo data.txt");
    } else {
      Serial.println("\n     Archivo data.txt Creado Exitosamente");
      file.close();
    }
  } else {
    Serial.println("\n     Se Encontro el Archivo data.txt ");
  }
}

void appendDataToFile(const String &data) {
  File file = LittleFS.open("/data.txt", "a");
  if (!file) {
    DEBUG_PRINT("\nError al abrir el archivo para escritura");
  } else {
    file.println(data);
    file.close();
    DEBUG_PRINT("\nArchivo guardado correctamente en memoria");
  }
}

/*LEE CONTENIDO DE DATA.TEXT
void readAllDataFromFile() {
  File file = LittleFS.open("/data.txt", "r");
  if (!file) {
    DEBUG_PRINT("\n     Error al abrir el archivo para lectura");
  } else {
    DEBUG_PRINT("\n     Archivo abierto correctamente");
    while (file.available()) {
      Serial.write(file.read());
    }
    file.close();
  }
}
*/

void copyFileExceptSentLine(const String &sentLine) {
  File sourceFile = LittleFS.open("/data.txt", "r");
  File tempFile = LittleFS.open("/temp.txt", "w");

  if (!sourceFile || !tempFile) {
    DEBUG_PRINT("\n     Error al abrir archivos para actualizar datos no enviados");
    return;
  }

  String line;
  while (sourceFile.available()) {
    line = sourceFile.readStringUntil('\n');
    if (line != sentLine) {
      tempFile.println(line);
    }
  }

  sourceFile.close();
  tempFile.close();

}

void replaceOriginalFileWithTemp() {
  if (LittleFS.remove("/data.txt")) {
    if (LittleFS.rename("/temp.txt", "/data.txt")) {
      DEBUG_PRINT("\nArchivo de LittleFS actualizado correctamente");
    } else {
      DEBUG_PRINT("\nError al renombrar el archivo temporal");
    }
  } else {
    DEBUG_PRINT("\nError al eliminar el archivo original de LittleFS");
  }
}

void sendDataFromLittleFS() {

  if (WiFi.status() != WL_CONNECTED) {
    return;
  }
  
  File file = LittleFS.open("/data.txt", "r"); 
  if (!file) {
    DEBUG_PRINT("\n\n\n\nError al intentar enviar desde LittleFS nose pudo abrir el archivo data.text para lectura");
   // file.close(); // Cierra el archivo
  } else {
    if (file.available()) { // Verifica si hay datos en el archivo
      String line; // Variable para almacenar cada línea leída
      while (file.available()) { // Mientras haya datos en el archivo
        line = file.readStringUntil('\n'); // Lee una línea hasta el carácter de nueva línea
        DEBUG_PRINT("\n\n\n\nAbriendo dato almacenado desde LittleFS");
        //DEBUG_PRINTLN(line);

        file.close(); // Cierra el archivo

        //HTTP POST
        http.begin(url_api);
        http.addHeader("Content-Type", "application/json"); 

        int responseCode = http.POST(line);

        if (responseCode < 0) {
          DEBUG_PRINT("\n\nError al intentar enviar Post Request desde LittleFS ");
          http.end();
          return;
        }

        if (responseCode != 200) {
          DEBUG_PRINT("\n\nError en response al intentar enviar desde LittleFS :  ");
          DEBUG_PRINTLN(responseCode);
          http.end();
          return;
        }

        if (responseCode == 200) {
          String responseBody = http.getString();

          DEBUG_PRINT("\n\nDatos enviados desde LittleFS :  ");
          DEBUG_PRINTLN(line);

          http.end();

          // Copia el contenido del archivo original a un archivo temporal
          // excepto la línea enviada
          copyFileExceptSentLine(line);
          // Reemplaza el archivo original con el archivo temporal
          replaceOriginalFileWithTemp();
        }
    
        // Abre el archivo nuevamente para la siguiente lectura
        file = LittleFS.open("/data.txt", "r");
      }
      file.close(); 
    } else {
      file.close(); 
      DEBUG_PRINT("\nNo hay datos para enviar desde LittleFS");
    }
  }
}



/*--------PRUEBA - RELE CONTADOR ACTIVACIONES CADA X TIEMPO ----------*/
int count_prueba = 0; // Declarar una variable de contador




void setup()
{

