arturoriegaore/ESP32S3_TDV_ESTAMPADO_SALVADE_PRUEBA_SERVER_BD_WEB/src/main.cpp
 Serial.begin(115200);
 
 configTime(gmtOffset_sec, daylightOffset_sec, ntpServer);

 Wire.begin(SDA_PIN, SCL_PIN);//iniciando I2C

   int attempts = 0;
  while (!rtc_ds3231.begin() && attempts < MAX_ATTEMPTS) {
    attempts++;
    Serial.println("\n\n Intentando iniciar el modulo DS3231");
    delay(1000);
   }
  
  if (attempts == MAX_ATTEMPTS) {
    Serial.println("\n\n No se pudo encontrar el modulo DS3231 valido");
    updateLedStatusRTC(); //alarma si no se logra actualizar datos de servidor ntp
     //deberia activarse la alarma updateLedStatusRTC() por que no detectaria el año valido
  }



 WiFi.setHostname(codDevice);


 

 queue = xQueueCreate(100, sizeof(InputInfo));  //Cola

 
 Serial.print("\n\n\n     Host: ");
 Serial.println(WiFi.getHostname());

 initializeLittleFS();
 ensureFileExists();
 displayLittleFSSpace();


 pinMode(IN1, INPUT);
 pinMode(IN2, INPUT);
 pinMode(IN3, INPUT);
 pinMode(IN4, INPUT);
 pinMode(IN5, INPUT);
 pinMode(IN6, INPUT);
 pinMode(IN7, INPUT);
 pinMode(IN8, INPUT);
 pinMode(IN9, INPUT);
 


 pinMode(RL1, OUTPUT);
 digitalWrite(RL1, LOW);
 pinMode(RL2, OUTPUT);
 digitalWrite(RL2, LOW);
 pinMode(RL3, OUTPUT);
 digitalWrite(RL3, LOW);


 pinMode(LEDWIFI, OUTPUT);
 digitalWrite(LEDWIFI, LOW);
 pinMode(LEDRTC, OUTPUT);
 digitalWrite(LEDRTC, LOW);


 attachInterrupt(digitalPinToInterrupt(IN10), countInterrupt, FALLING);  // Establece interrupción en el pin de entrada 10
 


/*--------DETECCION DE PERDIDA DE ENERGIA DEL DS3231----------*/
 if (rtc_ds3231.lostPower()) {  //detecta perdida de energia en el modulo DS3231
    digitalWrite(LEDRTC, HIGH);
    ledStatus = true; // Cambia el estado del LED
  }




  
 debouncer1.attach(IN1);
 debouncer1.interval(1000); // intervalo en ms  //Dar 1 seg para q no detecte join stoll

 debouncer2.attach(IN2);
 debouncer2.interval(1000); // intervalo en ms

 debouncer3.attach(IN3);
 debouncer3.interval(1000); // intervalo en ms
 
 debouncer4.attach(IN4);
 debouncer4.interval(600); // intervalo en ms
 
 debouncer5.attach(IN5);
 debouncer5.interval(600); // intervalo en ms
 
 debouncer6.attach(IN6);
 debouncer6.interval(1000); // intervalo en ms   //aumentar si es preciso ya que da muchos activaciones caida de tela
 
 debouncer7.attach(IN7);
 debouncer7.interval(600); // intervalo en ms
 
 debouncer8.attach(IN8);
 debouncer8.interval(600); // intervalo en ms
 
 debouncer9.attach(IN9);
 debouncer9.interval(600); // intervalo en ms


 // Comprueba y registra el estado inicial de las entradas digitales
 debouncer1.update();
 if (debouncer1.read() == HIGH) 
   {
   InputInfo initialInfo1 = {IN1, HIGH};
   xQueueSend(queue, &initialInfo1, 0); //xQueueSend(queue, &initialInfo1, portMAX_DELAY);
   }
 
 debouncer2.update();
 if (debouncer2.read() == HIGH)
   {
   InputInfo initialInfo2 = {IN2, HIGH};
   xQueueSend(queue, &initialInfo2, 0); //xQueueSend(queue, &initialInfo2, portMAX_DELAY);
   }

   debouncer3.update();
 if (debouncer3.read() == HIGH) 
   {
   InputInfo initialInfo3 = {IN3, HIGH};
   xQueueSend(queue, &initialInfo3, 0); //xQueueSend(queue, &initialInfo2, portMAX_DELAY);
   }

   debouncer4.update();
 if (debouncer4.read() == LOW) 
   {
   InputInfo initialInfo4 = {IN4, LOW};
   xQueueSend(queue, &initialInfo4, 0); //xQueueSend(queue, &initialInfo2, portMAX_DELAY);
   }

   debouncer5.update();
 if (debouncer5.read() == LOW) 
   {
   InputInfo initialInfo5 = {IN5, LOW};
   xQueueSend(queue, &initialInfo5, 0); //xQueueSend(queue, &initialInfo2, portMAX_DELAY);
   }

   debouncer6.update();
 if (debouncer6.read() == LOW) 
   {
   InputInfo initialInfo6 = {IN6, LOW};
   xQueueSend(queue, &initialInfo6, 0); //xQueueSend(queue, &initialInfo2, portMAX_DELAY);
   }

   debouncer7.update();
 if (debouncer7.read() == LOW) 
   {
   InputInfo initialInfo7 = {IN7, LOW};
   xQueueSend(queue, &initialInfo7, 0); //xQueueSend(queue, &initialInfo2, portMAX_DELAY);
   }

   debouncer8.update();
 if (debouncer8.read() == LOW) 
   {
   InputInfo initialInfo8 = {IN8, LOW};
   xQueueSend(queue, &initialInfo8, 0); //xQueueSend(queue, &initialInfo2, portMAX_DELAY);
   }

   debouncer9.update();
 if (debouncer9.read() == LOW) 
   {
   InputInfo initialInfo9 = {IN9, LOW};
   xQueueSend(queue, &initialInfo9, 0); //xQueueSend(queue, &initialInfo2, portMAX_DELAY);
   }



 xTaskCreatePinnedToCore(
                   Task1code,
                   "Task1",
                   10000,
                   NULL,
                   1,
                   NULL,
                   0);





Serial.print("\n     Servidor NTP : ");
Serial.print(ntpServer);

Serial.print("\n\n\n\n         Codigo de Depuracion : ");


}



void loop()
{
  reconnectWiFi();

  updateLedStatusWifi();
  updateReleStatusInput();




  

  if (!timeoutOver) // Si aún no ha pasado el tiempo de espera
  {
  if (WiFi.status() == WL_CONNECTED) 
  { 
    if (millis() - startTimeoutForNTP >= 15000)   
    {
      updateTimeDevice();
    }
  }
  }
  






  /*--------ACTIVAR/DESACTIVAR DEPURACION----------*/

  if (Serial.available()) {
    
    String cod = Serial.readStringUntil('\n'); // Lee la línea desde la interfaz serie

    if (cod == DEBUG_CMD) {
      debugEnabled = !debugEnabled;  // Cambia el estado de debugEnabled
      Serial.println(debugEnabled ? "         DEPURACION HABILITADA" : "\n\n\n         DEPURACION DESHABILITADA");
    }
  }


/*-------------------------ENVIAR ESTADOS A BD---------------------------*/      

    InputInfo info;

    if (uxQueueMessagesWaiting(queue) > 0) 
{

    if(xQueueReceive(queue, &info, 0))
 {

 /*-------------------------DIGITAL IMPUT 1---------------------------*/
  if(info.pin == IN1)

  {
     static String  codStaticIN1 = "";

        if(info.state == HIGH) 

        {  codStaticIN1 = getDateTimeCodeDS3231();  //rtc_esp32.getTime("%Y%m%d%H%M%S");  // Actualizar el código cuando PIN1 esté en alto
 
  //JSON  A ENVIAR POR POST
    json.clear();                                                        
    json["CodMaquina"] = codMaquina,                  
    json["CodParo"] = codParoIN1,                    
    json["CodUnicoParo"] = codStaticIN1,          
    json["FechaHoraIniParo"] = getDateTimeDS3231(),   //rtc_esp32.getTime("%FT%T"),         
    json["FechaHoraFinParo"] = "",          
    json["Rpm"] = 0,                                      

   //HTTP POST
   http.begin(url_api);   
   http.addHeader("Content-Type", "application/json"); 

   int responseCode = http.POST(json.as<String>());

